
** Script.py

#+begin_src python :results output
  import pandas as pd
  import numpy as np
  import matplotlib.pyplot as plt

  df = pd.read_csv("student_math.csv")
  print(df.head())

  # setting target and predictor variables
  y = df['Final_Grade']
  X = df.drop(columns = ['Final_Grade'])

  # 1. Number of features
  num_features = len(X.columns)
  print("Number of features: ", num_features)

  # Performing a Train-Test split
  from sklearn.model_selection import train_test_split
  X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)

  # Fitting a Linear Regression Model
  from sklearn.linear_model import LinearRegression
  model = LinearRegression()
  model.fit(X_train, y_train)

  # Training Error
  pred_train = model.predict(X_train)
  MSE_train = np.mean((pred_train - y_train)**2)
  print("Training Error: ", MSE_train)

  # 2. Testing Error
  pred_test = model.predict(X_test)
  MSE_test = np.mean((pred_test - y_test)**2)
  print("Testing Error: ", MSE_test)

  # Calculating the regression coefficients
  predictors = X.columns
  coef = pd.Series(model.coef_,predictors).sort_values()

  # 3. Plotting the Coefficients
  plt.figure(figsize = (15,10))
  coef.plot(kind='bar', fontsize = 20)
  plt.title("Regression Coefficients", fontsize = 30)
  plt.show()

#+end_src

#+RESULTS:
#+begin_example
   age  Medu  Fedu  ...  higher_yes  internet_yes  romantic_yes
0   18     4     4  ...           1             0             0
1   17     1     1  ...           1             1             0
2   15     1     1  ...           1             1             0
3   15     4     2  ...           1             1             1
4   16     3     3  ...           1             0             0

[5 rows x 42 columns]
Number of features:  41
Training Error:  2.6268841802196254
Testing Error:  4.987346573982337
#+end_example

** Scritp.py

#+begin_src python :results output
  import numpy as np
  import matplotlib.pyplot as plt

  from sklearn import datasets
  data, y, coefficients = datasets.make_regression(n_samples = 100, n_features = 2, coef = True, random_state = 23)
  x1 = data[:,0]
  x2 = data[:,1]

  # 1. Print the coefficients
  print(coefficients)

  # 2. Loss function
  def loss_function(b1,b2,y,x1,x2):
      error = y - b1*x1 - b2*x2
      loss = np.mean(error**2)
      return loss

  # 3. Plot loss function for data
  from plot_loss import plot_loss_function
  b1 = np.linspace(-150, 150, 501)
  b2 = np.linspace(-150, 150, 501)
  contour_plot = plot_loss_function(b1,b2,y,x1,x2)


  # 4. Plot the best fit coefficients
  best_fit_b1 = coefficients[0]
  best_fit_b2 = coefficients[1]
  plt.scatter(best_fit_b1, best_fit_b2, s=50., color='green')
  plt.show()

#+end_src

#+RESULTS:
: [77.30856619 18.87896326]

** Task 3
We see how our training error went up but our test error went down, which makes sense as our model is performing slightly better on test data at the cost of performing slightly worse on training data. What do our coefficients look like post Lasso regularization?

Add plt.show() and press "Run".

Lasso has shrunk more than half our coefficients to zero! Additionally, while the value of all the coefficients have shrunk, Lasso has increased the relative importance of some. An important thing to note here is that we manually set the value of alpha to 0.1. The number of features that get eliminated due to Lasso is definitely tied to the value of alpha -we're going to examine this more after we cover the basics of L2 or Ridge regularization.

#+begin_src python :results output
  import pandas as pd
  import numpy as np
  import matplotlib.pyplot as plt
  import helpers

  df = pd.read_csv("student_math.csv")
  y = df['Final_Grade']
  X = df.drop(columns = ['Final_Grade'])

  # 1. Train-test split and fitting an L1-regularized regression model
  from sklearn.model_selection import train_test_split
  from sklearn.linear_model import Lasso

  X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.33, random_state=42)
  lasso = Lasso(alpha=0.1)
  lasso.fit(X_train, y_train)

  l1_pred_train = lasso.predict(X_train)
  l1_mse_train = np.mean((l1_pred_train - y_train)**2)
  print("Lasso (L1) Training Error: ", l1_mse_train)

  # 2. Calculate testing error
  l1_pred_test = lasso.predict(X_test)
  l1_mse_test = np.mean((l1_pred_test - y_test)**2)
  print("Lasso (L1) Testing Error: ", l1_mse_test)

  # 3. Plotting the coefficients
  predictors = X.columns
  coef = pd.Series(lasso.coef_, predictors).sort_values()
  plt.figure(figsize = (12,8))
  plt.ylim(-1.0,1.0)
  coef.plot(kind='bar', title='Regression Coefficient with Lasso (L1) Regularization')

  plt.show()
#+end_src

#+RESULTS:
: Lasso (L1) Training Error:  3.0118464559476825
: Lasso (L1) Testing Error:  4.272174214435374
